In [2]:
import pandas as pd

import numpy as np

In [5]:
df = pd.read_csv('h1.csv')
df

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [7]:
df['Date']

0     Jan-2010
1     Feb-2010
2     Mar-2010
3     Apr-2010
4     May-2010
        ...
81    Oct-2016
82    Nov-2016
83    Dec-2016
84    Jan-2017
85    Feb-2017
Name: Date, Length: 86, dtype: object

In [11]:
df['Date'].nunique()

86

In [12]:
print('Total months: ', df['Date'].nunique())

Total months:  86

In [14]:
df['Profit/Losses'].sum()

38382578

In [15]:
print('Total: $',df['Profit/Losses'].sum() )

Total: $ 38382578

In [16]:
df['ChPandL'] = df['Profit/Losses'].diff()
df

        Date  Profit/Losses   ChPandL
0   Jan-2010         867884       NaN
1   Feb-2010         984655  116771.0
2   Mar-2010         322013 -662642.0
3   Apr-2010         -69417 -391430.0
4   May-2010         310503  379920.0
..       ...            ...       ...
81  Oct-2016         102685 -665765.0
82  Nov-2016         795914  693229.0
83  Dec-2016          60988 -734926.0
84  Jan-2017         138230   77242.0
85  Feb-2017         671099  532869.0

[86 rows x 3 columns]

In [17]:
df['ChPandL'].mean()

-2315.1176470588234

In [18]:
print('Average Change: $',df['ChPandL'].mean())

Average Change: $ -2315.1176470588234

In [22]:
df['ChPandL'].idxmax()

25

In [26]:
df[df['ChPandL'].idxmax():df['ChPandL'].idxmax()+1]

        Date  Profit/Losses    ChPandL
25  Feb-2012        1170593  1926159.0

In [27]:
df[df['ChPandL'].idxmax():df['ChPandL'].idxmax()+1]['Date']

25    Feb-2012
Name: Date, dtype: object

In [29]:
print('Greatest Increase in Profits: ', df[df['ChPandL'].idxmax():df['ChPandL'].idxmax()+1]['Date'])

Greatest Increase in Profits:  25    Feb-2012
Name: Date, dtype: object

In [36]:
df.iloc[df['ChPandL'].idxmax(),0]

'Feb-2012'

In [37]:
df.iloc[df['ChPandL'].idxmax(),2]

1926159.0

In [40]:
print('Greatest Increase in Profits:', df.iloc[df['ChPandL'].idxmax(),0], df.iloc[df['ChPandL'].idxmax(),2])

Greatest Increase in Profits:
 Feb-2012 1926159.0